Documents/РеестрИНПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РеестрИНПС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>CalculationRegister.Удержания</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьПоБУ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпорядочитьПоФамилии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляСортировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>29</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаНарастающим</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобровольныйВзнос</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеРезидент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Надомник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУдерживатьПрофвзносы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУдерживатьВПенсионныйФонд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныУвольнения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CalculationRegisters/Удержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<CalculationRegister>
		<Properties>
			<Name>Удержания</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>false</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Удержания</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СправочникОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПостоянныеРасчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиРегистратора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаУдержаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фиксированный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Documents/РеестрИНПС/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Реестр","Реестр");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ДвиженияПоРасчетнымРегистрам();
	ДвиженияПоБУ();
	
КонецПроцедуры

Процедура ДвиженияПоБУ()
	
	ВидРасчета=ПланыВидовРасчета.Удержания.ИНПС;
	
	Проводка = Движения.Хозрасчетный.Добавить();
	Проводка.Период      = Дата;
	Проводка.Организация = Организация;
	Проводка.Содержание = "";     
	
	Проводка.СчетДт      = ВидРасчета.СчетДт;
	УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,ВидРасчета.СубконтоДт1);
	УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2,ВидРасчета.СубконтоДт2);
	УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3,ВидРасчета.СубконтоДт3);
	
	Проводка.СчетКт      = ВидРасчета.СчетБУ;
	УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,ВидРасчета.СубконтоБУ1);
	УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2,ВидРасчета.СубконтоБУ2);
	УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,3,ВидРасчета.СубконтоБУ3);
	Проводка.Сумма=Сотрудники.Итог("Результат");
	
	
КонецПроцедуры

Процедура ДвиженияПоРасчетнымРегистрам()
	
	Запрос=новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Сотрудник В (&СписокСотрудников)) КАК РаботникиОрганизацийСрезПоследних";
	
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("СписокСотрудников",Сотрудники.ВыгрузитьКолонку("Сотрудник"));
	
	СведенияОПодразделениях=Запрос.Выполнить().Выгрузить();
	
	НТП=НачалоМесяца(Дата);
	КТП=КонецМесяца(Дата);
	
	ВидРасчета=ПланыВидовРасчета.Удержания.ИНПС;
	
	Для Каждого ТекСтрокаРасчеты Из СОтрудники Цикл
		
		Если ТекСтрокаРасчеты.Результат<>0 Тогда
			
			Движение = Движения.Удержания.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ВидРасчета;
			Движение.ПериодРегистрации = Дата;
			Движение.Организация = Организация;
			Движение.Сотрудник = ТекСтрокаРасчеты.Сотрудник;
			Движение.Результат = ТекСтрокаРасчеты.Результат;
			Движение.ДатаНачала = НТП;
			Движение.ДатаОкончания = КТП;
			
			СведенияОПодразделении=СведенияОПодразделениях.Найти(ТекСтрокаРасчеты.Сотрудник);
			
			Если СведенияОПодразделении=Неопределено Тогда
				Сообщить("Нет данных о подразделении сотрудника "+ТекСтрокаРасчеты.Сотрудник.Наименование+" таб.№ "+ТекСтрокаРасчеты.Сотрудник.Код,СтатусСообщения.Важное);
				Отказ=истина;
			Иначе
				Движение.Подразделение = СведенияОПодразделении.ПодразделениеОрганизации;
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьЗапрос()
		Условие = "";
	Если УпорядочитьПоФамилии Тогда 
		Условие = Условие + ".Наименование";
	Иначе
		Условие = Условие + ".Код";
	КонецЕсли;
	
	Запрос=новый Запрос;
	Если НачалоМесяца(Дата)=НачалоГода(Дата) Тогда
		Запрос.Текст=
		"ВЫБРАТЬ
		|	РеестрИНПССотрудники.Сотрудник,
		|	РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо.ИНПС КАК ИНПС,
		|	РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо.ФИОНаЛатинице КАК ФИОНаЛатинице,
		|	РеестрИНПССотрудники.Результат КАК Результат,
		|	РеестрИНПССотрудники.БазаНарастающим КАК База,
		|	РеестрИНПССотрудники.ДобровольныйВзнос КАК ДобровольныйВзнос,
		|	РеестрИНПССотрудники.Результат + РеестрИНПССотрудники.ДобровольныйВзнос КАК Всего,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество
		|ИЗ
		|	Документ.РеестрИНПС.Сотрудники КАК РеестрИНПССотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрИНПС КАК РеестрИНПС
		|		ПО РеестрИНПССотрудники.Ссылка = РеестрИНПС.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
		|		ПО РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	РеестрИНПС.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеестрИНПССотрудники.Сотрудник"+Условие+"
		|ИТОГИ
		|	СУММА(Результат),
		|	СУММА(База),
		|	СУММА(ДобровольныйВзнос),
		|	СУММА(Всего)
		|ПО
		|	ОБЩИЕ";
	Иначе
		Запрос.Текст=
		"ВЫБРАТЬ
		|	РеестрИНПССотрудники.Сотрудник,
		|	РеестрИНПССотрудники.БазаНарастающим,
		|	РеестрИНПССотрудники.Результат,
		|	НАЧАЛОПЕРИОДА(РеестрИНПССотрудники.Ссылка.Дата, МЕСЯЦ) КАК Месяц
		|ПОМЕСТИТЬ ВыборкаИзРеестра
		|ИЗ
		|	Документ.РеестрИНПС.Сотрудники КАК РеестрИНПССотрудники
		|ГДЕ
		|	РеестрИНПССотрудники.Ссылка.Дата МЕЖДУ &НачалоГода И &КонецПериода
		|	И РеестрИНПССотрудники.Ссылка.Организация = &Организация
		|	И РеестрИНПССотрудники.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыборкаИзРеестра.Сотрудник,
		|	МАКСИМУМ(ВыборкаИзРеестра.Месяц) КАК Месяц
		|ПОМЕСТИТЬ ПоследнийМесяц
		|ИЗ
		|	ВыборкаИзРеестра КАК ВыборкаИзРеестра
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыборкаИзРеестра.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыборкаИзРеестра.Сотрудник,
		|	ВыборкаИзРеестра.БазаНарастающим,
		|	ВыборкаИзРеестра.Результат,
		|	ВыборкаИзРеестра.Месяц
		|ПОМЕСТИТЬ СуммаПрМесяц
		|ИЗ
		|	ВыборкаИзРеестра КАК ВыборкаИзРеестра
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследнийМесяц КАК ПоследнийМесяц
		|		ПО ВыборкаИзРеестра.Сотрудник = ПоследнийМесяц.Сотрудник
		|			И ВыборкаИзРеестра.Месяц = ПоследнийМесяц.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеестрИНПССотрудники.Сотрудник,
		|	РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо.ИНПС КАК ИНПС,
		|	РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо.ФИОНаЛатинице КАК ФИОНаЛатинице,
		|	РеестрИНПССотрудники.Результат КАК Результат,
		|	ВЫБОР
		|		КОГДА РеестрИНПССотрудники.Результат / &Ставка * 100 - (ЕСТЬNULL(РеестрИНПССотрудники.БазаНарастающим, 0) - ЕСТЬNULL(СуммаПрМесяц.БазаНарастающим, ЕСТЬNULL(СведенияПоСправкам.ОблагаемыйДоход, 0))) МЕЖДУ -10 И 10
		|			ТОГДА ЕСТЬNULL(РеестрИНПССотрудники.БазаНарастающим, 0) - ЕСТЬNULL(СуммаПрМесяц.БазаНарастающим, ЕСТЬNULL(СведенияПоСправкам.ОблагаемыйДоход, 0))
		|		ИНАЧЕ РеестрИНПССотрудники.Результат / &Ставка * 100
		|	КОНЕЦ КАК База,
		|	РеестрИНПССотрудники.ДобровольныйВзнос КАК ДобровольныйВзнос,
		|	РеестрИНПССотрудники.Результат + РеестрИНПССотрудники.ДобровольныйВзнос КАК Всего,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество
		|ИЗ
		|	Документ.РеестрИНПС.Сотрудники КАК РеестрИНПССотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрИНПС КАК РеестрИНПС
		|		ПО РеестрИНПССотрудники.Ссылка = РеестрИНПС.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаПрМесяц КАК СуммаПрМесяц
		|		ПО РеестрИНПССотрудники.Сотрудник = СуммаПрМесяц.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВложенныйЗапрос.Сотрудник КАК Сотрудник,
		|			СУММА(ВложенныйЗапрос.ОблагаемыйДоход) КАК ОблагаемыйДоход
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ДоходыПредыдущегоМестаРаботы.Сотрудник КАК Сотрудник,
		|				ДоходыПредыдущегоМестаРаботы.ОблагаемыйДоход + ДоходыПредыдущегоМестаРаботы.РайонныйКоэффициент КАК ОблагаемыйДоход
		|			ИЗ
		|				РегистрСведений.ДоходыПредыдущегоМестаРаботы КАК ДоходыПредыдущегоМестаРаботы
		|			ГДЕ
		|				ДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода = &МесяцНалоговогоПериода
		|				И ДоходыПредыдущегоМестаРаботы.Организация = &Организация
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ДоходыСОсновногоМестаРаботы.Сотрудник,
		|				ДоходыСОсновногоМестаРаботы.ОблагаемыйДоход + ДоходыСОсновногоМестаРаботы.РайонныйКоэффициент
		|			ИЗ
		|				РегистрСведений.ДоходыСОсновногоМестаРаботы КАК ДоходыСОсновногоМестаРаботы
		|			ГДЕ
		|				ДоходыСОсновногоМестаРаботы.МесяцНалоговогоПериода = &МесяцНалоговогоПериода
		|				И ДоходыСОсновногоМестаРаботы.Организация = &Организация) КАК ВложенныйЗапрос
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.Сотрудник) КАК СведенияПоСправкам
		|		ПО РеестрИНПССотрудники.Сотрудник = СведенияПоСправкам.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
		|		ПО РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	РеестрИНПС.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеестрИНПССотрудники.Сотрудник"+Условие+"
		|ИТОГИ
		|	СУММА(Результат),
		|	СУММА(База),
		|	СУММА(ДобровольныйВзнос),
		|	СУММА(Всего)
		|ПО
		|	ОБЩИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВыборкаИзРеестра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПоследнийМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СуммаПрМесяц";
		Запрос.УстановитьПараметр("Организация",Организация);
		КонецПрМесяца=НачалоМесяца(Дата)-1;
		Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(КонецПрМесяца));
		Запрос.УстановитьПараметр("КонецПериода",КонецПрМесяца);
		Запрос.УстановитьПараметр("МесяцНалоговогоПериода",НачалоМесяца(Дата));
		//Запрос.УстановитьПараметр("МесяцНалоговогоПериода",НачалоМесяца(КонецПрМесяца));
		Запрос.УстановитьПараметр("НачалоГода",НачалоГода(КонецПрМесяца));
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Ставка",	СтавкаПлатежа("ИНПС",КонецМесяца(Дата)));
	
	Возврат Запрос.Выполнить();
	
КонецФункции	

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Отчет");
	
	Результат=СформироватьЗапрос();
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы.Параметры.Номер = Номер;
	ОбластьШапкаТаблицы.Параметры.Дата  = Формат(Дата,"ДФ=dd.MM.yyyy");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("Подвал");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	НомерСтроки=0;
	итбаза=0;	
	
	ВыборкаОбщие=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщие.Следующий();
	ОбластьПодвалТаблицы.Параметры.Заполнить(ВыборкаОбщие);
	
	Выборка=ВыборкаОбщие.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НомерСтроки=НомерСтроки+1;
		
		ОбластьДетальныхЗаписей.Параметры.Заполнить(Выборка);
		ОбластьДетальныхЗаписей.Параметры.НомерСтроки=НомерСтроки;
		
		Если СокрЛП(Выборка.ФИОНаЛатинице)<>"" Тогда
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = СокрЛП(Выборка.ФИОНаЛатинице);
		КонецЕсли;	

		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	Руководители = ОтветственныеЛица(Организация, КонецМесяца(Дата));	
	
	ОбластьПодвалТаблицы.Параметры.Заполнить(Руководители);
	ОбластьПодвалТаблицы.Параметры.ВсегоПрописью=СформироватьСуммуПрописью(ВыборкаОбщие.Всего,Константы.ВалютаРегламентированногоУчета.Получить());;
	
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	
	ТабДок.автомасштаб=истина;
	//ТабДок.ФиксацияСверху=13;
	ТабДок.ПовторятьПриПечатиСтроки=ТабДок.Область(13,,13);
	
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
	
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

Процедура ФормироватьФайлИНПС (Платежка, ИмяФайлаДанных) Экспорт 
	НомерПлатПоручения = "0000000000";
	КоличествоСимволов = СтрДлина(НомерПлатПоручения);
	ДлинаНомера = СтрДлина(Формат(Платежка.Номер,"ЧГ=0")) ;
	НомерПлатПоручения = Лев(НомерПлатПоручения,(КоличествоСимволов-ДлинаНомера)) + Строка(Формат(Платежка.Номер,"ЧГ=0")) ;
	ДатаПлатПоручения  = Платежка.Дата ; 
	
	Результат=СформироватьЗапрос();

	Выборка = Результат.Выбрать();
	
	Сообщить("Формируется файл выгрузки ...");
	Документ = Новый ТекстовыйДокумент;
	
	СимволРазделитель = Символ(29);
	СтрокаРеестра = "1" + СимволРазделитель + "Version" + СимволРазделитель;
	
	// первая строка 
	Документ.ДобавитьСтроку(СтрокаРеестра);
	
	// вторая строка
	Если Выборка.Следующий() Тогда
		
		СтрокаРеестра = прав(СокрЛП(Номер),5) + СимволРазделитель + СимволРазделитель + СимволРазделитель 
		+ прав(СокрЛП(НомерПлатПоручения),10) + СимволРазделитель
		+ Формат(ДатаПлатПоручения,"ДЛФ=D") + СимволРазделитель 
		+ СокрЛП(Организация.ИНН) + СимволРазделитель 
		+ Формат(Выборка.Количество()-1,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель 
		+ Формат(Выборка.Всего*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель 
		+ Формат(Выборка.Результат*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель 
		+ Формат(Выборка.ДобровольныйВзнос*100,"ЧЦ=20; ЧДЦ=0; ЧН=; ЧГ=") + СимволРазделитель + СимволРазделитель
		+ Формат(Дата,"ДЛФ=D") + СимволРазделитель + Формат(КонецМесяца(Дата),"ДЛФ=D") + СимволРазделитель
		+ Формат(Выборка.База*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель;	
		Документ.ДобавитьСтроку(СтрокаРеестра);
		
	КонецЕсли;
	
	// следующие строки
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ИНПС) и Выборка.Результат > 0 Тогда
			Если СокрЛП(Выборка.ФИОНаЛатинице)="" Тогда
				СтрокаРеестра = СокрЛП(Выборка.ИНПС) + СимволРазделитель 
				+ СокрЛП(Выборка.Фамилия) + СимволРазделитель
				+ СокрЛП(Выборка.Имя) + СимволРазделитель 
				+ СокрЛП(Выборка.Отчество) + СимволРазделитель
				+ Формат(Выборка.База*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель
				+ Формат(Выборка.Всего*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель 
				+ Формат(Выборка.Результат*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель 
				+ Формат(Выборка.ДобровольныйВзнос*100,"ЧЦ=20; ЧДЦ=0; ЧН=; ЧГ=") + СимволРазделитель + СимволРазделитель + СимволРазделитель; 
			Иначе
				
				РазбитоеФИО=РазбитьФИО(Выборка.ФИОНаЛатинице);
				СтрокаРеестра = СокрЛП(Выборка.ИНПС) + СимволРазделитель 
				+ СокрЛП(РазбитоеФИО.Фамилия) + СимволРазделитель
				+ СокрЛП(РазбитоеФИО.Имя) + СимволРазделитель 
				+ СокрЛП(РазбитоеФИО.Отчество) + СимволРазделитель
				+ Формат(Выборка.База*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель
				+ Формат(Выборка.Всего*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель 
				+ Формат(Выборка.Результат*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель 
				+ Формат(Выборка.ДобровольныйВзнос*100,"ЧЦ=20; ЧДЦ=0;ЧН=; ЧГ=") + СимволРазделитель + СимволРазделитель + СимволРазделитель; 
				
			КонецЕсли;
			Документ.ДобавитьСтроку(СтрокаРеестра);
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	Документ.Записать(ИмяФайлаДанных,"windows-1251");
	Сообщить("Файл выгрузки сформирован!");
	
КонецПроцедуры

Процедура ФормироватьФайлИНПСExcel(Платежка, ИмяФайлаДанных) Экспорт
	
	Результат=СформироватьЗапрос();
	
	ВыборкаИтога = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтога.Следующий();
	Сообщить("Формируется файл выгрузки ...");
	Excel = Новый COMОбъект("Excel.Application"); 
	
	Excel.Application.Workbooks.Add(1); 
	НомерКниги = Excel.Workbooks.Count; 
	КнигаНовая = Excel.Workbooks.Item(НомерКниги); 
	ЛистНовый = Excel.ActiveSheet;	
	
	НомерСтроки=1;
	Выборка = ВыборкаИтога.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЛистНовый.Cells( НомерСтроки, 1).NumberFormat ="@" ;
	ЛистНовый.Cells( НомерСтроки, 1).Value = "Номер ИНПС";
	ЛистНовый.Cells( НомерСтроки, 2).NumberFormat ="@" ;
	ЛистНовый.Cells( НомерСтроки, 2).Value = "Фамилия";
	ЛистНовый.Cells( НомерСтроки, 3).NumberFormat ="@" ;
	ЛистНовый.Cells( НомерСтроки, 3).Value = "Имя";
	ЛистНовый.Cells( НомерСтроки, 4).NumberFormat ="@" ;
	ЛистНовый.Cells( НомерСтроки, 4).Value = "Отчество";
	ЛистНовый.Cells( НомерСтроки, 5).NumberFormat ="@" ;
	ЛистНовый.Cells( НомерСтроки, 5).Value = "Размер дохода";
	ЛистНовый.Cells( НомерСтроки, 6).NumberFormat ="@" ;
	ЛистНовый.Cells( НомерСтроки, 6).Value = "Обязательная сумма";
	ЛистНовый.Cells( НомерСтроки, 7).NumberFormat ="@" ;
	ЛистНовый.Cells( НомерСтроки, 7).Value = "Добровольная сумма";
	
	Пока Выборка.Следующий() Цикл  
		НомерСтроки=НомерСтроки+1;
		ЛистНовый.Cells( НомерСтроки, 1).NumberFormat ="@" ;
		ЛистНовый.Cells( НомерСтроки, 1).Value = СокрЛП(Выборка.ИНПС);
		ЛистНовый.Cells( НомерСтроки, 2).Value =СокрЛП(Выборка.Фамилия) ;
		ЛистНовый.Cells( НомерСтроки, 3).Value =СокрЛП(Выборка.Имя) ;
		ЛистНовый.Cells( НомерСтроки, 4).Value =СокрЛП(Выборка.Отчество) ;
		ЛистНовый.Cells( НомерСтроки,5).NumberFormat = "#0,00" ;
		ЛистНовый.Cells( НомерСтроки,5).Value = Выборка.База;
		ЛистНовый.Cells( НомерСтроки,6).NumberFormat = "#0,00" ;
		ЛистНовый.Cells( НомерСтроки,6).Value =Выборка.Результат;
		ЛистНовый.Cells( НомерСтроки,7).NumberFormat = "#0,00" ;
		ЛистНовый.Cells( НомерСтроки,7).Value =Выборка.ДобровольныйВзнос;
	КонецЦикла;
	Excel.Visible = Ложь;
	КнигаНовая.SaveAs(ИмяФайлаДанных);       //-4143
	Excel.Quit(); 
	Сообщить("Файл выгрузки сформирован!");
КонецПроцедуры
